
## :white_check_mark: Apply Succeeded (v3-proxy-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/56837)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.aws_region.region: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
aws_cloudwatch_log_group.aws-otel-collector-log-group: Refreshing state... [id=/Backend/V3ProxyApi-Prod/ecs/aws-otel-collector]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_sns_topic.backend_notifications: Reading...
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/83154caf-7675-4a7f-86e2-93af356c47dc]
data.aws_caller_identity.caller: Reading...
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=v3proxyapi-prod-app]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=1756567564]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_region.region: Read complete after 0s [id=us-east-1]
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/V3ProxyApi-Prod/ecs/app]
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/V3ProxyApi-Prod]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=996905175585]
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=61017ccc-b5c5-4a14-98c3-adb79537db2a:V3ProxyApi-Prod-ECS]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z05649472FMTVD4ZOESQK]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=996905175585]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_kms_alias.kms_alias: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=V3ProxyApi-Prod-ECSCodeDeployRole]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::996905175585:policy/V3ProxyApi-Prod-TaskRolePolicy]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=V3ProxyApi-Prod-TaskRole]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=V3ProxyApi-Prod-TaskExecutionRole]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=v3proxyapi-prod-app]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=3116375150]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::996905175585:policy/V3ProxyApi-Prod-TaskExecutionRolePolicy]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/2638ba141f813fbd9fd4f8e1bf57ee3a17f48739]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=V3ProxyApi-Prod-ECSCodeDeployRole-20230213231818225100000008]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z05649472FMTVD4ZOESQK__3908856df94e4ac308adf778015091fd.v3-proxy-api.readitlater.com._CNAME]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=Z2BHWTOWFVNW3M]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=Z2BHWTOWFVNW3M_v3-proxy-api.readitlater.com_NS]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=V3ProxyApi-Prod-TaskRole-2023021323181831660000000a]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=V3ProxyApi-Prod-TaskExecutionRole-20230213231818306300000009]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=V3ProxyApi-Prod]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=V3ProxyApi-Prod-TaskExecutionRole-2023021323181832830000000b]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2023-02-13 23:19:35.967 +0000 UTC]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 0s [id=vpc-867638e3]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-0149a253bfa33b594]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/v3Prxy20230213231817765000000005/415bd752a48fc80b]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/v3Prxy20230213231817835400000006/6e670fd0f9d676c3]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-014398a6a95e77b46]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/v3Prxy2023021323181927470000000d/5b3871332038c996]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z05649472FMTVD4ZOESQK_v3-proxy-api.readitlater.com_A_1]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/v3Prxy2023021323181927470000000d/5b3871332038c996/48b289a4f5c4a57a]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/v3Prxy2023021323181927470000000d/5b3871332038c996/49e7d22e6f72dcd5]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=V3ProxyApi-Prod-Alarm-HTTPTarget5xxErrorRate]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/v3Prxy2023021323181927470000000d/5b3871332038c996/48b289a4f5c4a57a/81eeeac1dfa69442]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=3c2c80f7ede1fb5334551066dbbd153d05bcc049]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/V3ProxyApi-Prod/V3ProxyApi-Prod]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/V3ProxyApi-Prod/V3ProxyApi-Prod]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=V3ProxyApi-Prod]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=5d39859c-b825-44c0-8122-7ed7df861051]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=V3ProxyApi-Prod-ScaleInPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=V3ProxyApi-Prod-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=V3ProxyApi-Prod Service Low CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=V3ProxyApi-Prod Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "app"
                                  + ContainerPort = 4029
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/V3ProxyApi-Prod:13"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=3c2c80f7ede1fb5334551066dbbd153d05bcc049]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"f21bbaa3-975f-4efa-a1c6-eeec4549143d","JobName":"v3-proxy-api_infrastructure_apply_prod","PRNumber":201,"Program":"tfcmt","SHA1":"96ab77dce528548174f8927550a26071910e71bf","Target":"v3-proxy-api-cdk","Vars":{}} -->